# Pandas-DataFrame And Series

pandas is a powerful data manipulation librabry in python, widely used for data analytics and data cleaning.It provides two primary data structures : Series and DataFrame. A series is a one-dimensional array-like object, while a DAtaFrame is two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (row and columns).

In [1]:
import pandas as pd

# Series

is a one-dimensional labelled array that can hold data of any type. It is mostly used to represent a single column or row of data.

In [2]:
data = [1,2,3,4,5]
series=pd.Series(data)
print("series \n", series)

series
 0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
### creating a Series from Dictionary
data={'a':1,'b':2,'c':3,'d':4}
series_dictionary =pd.Series(data)
print(series_dictionary)

a    1
b    2
c    3
d    4
dtype: int64

In [5]:
data=[10,20,30]
indexs=['a','b','c']
pd.Series(data,index=indexs)

a    10
b    20
c    30
dtype: int64

## DataFrame

In [7]:
data = {
    'Name':['rashmi','ruhi','ragini'],
    'Age':[33,56,39],
    'City':['Bangalore','ranchi','Bangkok']

}

df = pd.DataFrame(data)
print(df)
print(type(df))

     Name  Age       City
0  rashmi   33  Bangalore
1    ruhi   56     ranchi
2  ragini   39    Bangkok
<class 'pandas.core.frame.DataFrame'>

In [10]:
# create a Data frame from a list of dictionaries 

data = [
    {'Name':'Rashmi','Age':23,'City':'Bangalore'},
    {'Name':'Nancy','Age':24,'City':'Bangalore'},
    {'Name':'Mahi','Age':23,'City':'Mumbai'},
    {'Name':'Devyani','Age':20,'City':'Nagpur'}
]
df_1 = pd.DataFrame(data)
print(df_1)
print(type(df_1))

      Name  Age       City
0   Rashmi   23  Bangalore
1    Nancy   24  Bangalore
2     Mahi   23     Mumbai
3  Devyani   20     Nagpur
<class 'pandas.core.frame.DataFrame'>

how to read csv using pandas

In [25]:
df_2 = pd.read_csv('data_1.csv')
df_2.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

how to accessing data from dataframe

In [16]:
df_2['Category']

0     A
1     B
2     C
3     B
4     B
5     B
6     A
7     C
8     C
9     A
10    B
11    B
12    A
13    A
14    A
15    C
16    C
17    C
18    A
19    A
20    C
21    C
22    B
23    C
24    A
25    C
26    C
27    C
28    B
29    C
30    B
31    A
32    B
33    C
34    C
35    B
36    C
37    C
38    C
39    A
40    B
41    C
42    A
43    A
44    A
45    B
46    B
47    B
48    C
49    C
Name: Category, dtype: object

In [37]:
# # row info
# loc â†’ Label-based selection

# You select data using row/column labels.
print(df_2.loc[0,'Date'])
print(df_2.loc[2:10,['Value','Product']])

2023-01-01
    Value   Product
2    32.0  Product2
3     8.0  Product1
4    26.0  Product3
5    54.0  Product3
6    16.0  Product1
7    89.0  Product1
8    37.0  Product3
9    22.0  Product2
10    7.0  Product1

In [39]:
# 2. iloc â†’ Index-based selection
# You select data using row/column integer positions.
# Using iloc (index-based)
print(df_2.iloc[0, 0])          
print(df_2.iloc[0:10, 0:2])

2023-01-01
         Date Category
0  2023-01-01        A
1  2023-01-02        B
2  2023-01-03        C
3  2023-01-04        B
4  2023-01-05        B
5  2023-01-06        B
6  2023-01-07        A
7  2023-01-08        C
8  2023-01-09        C
9  2023-01-10        A

In [45]:
print(df_2.iat[2,2])

32.0

Data Manipulation with DataFrame

In [46]:
df

     Name  Age       City
0  rashmi   33  Bangalore
1    ruhi   56     ranchi
2  ragini   39    Bangkok

In [47]:
df['Salary']=[50000,60000,70000]
df

     Name  Age       City  Salary
0  rashmi   33  Bangalore   50000
1    ruhi   56     ranchi   60000
2  ragini   39    Bangkok   70000

In [ ]:
# remove a column
# it is not permanent
df.drop('Salary',axis=1)

     Name  Age       City
0  rashmi   33  Bangalore
1    ruhi   56     ranchi
2  ragini   39    Bangkok

In [50]:
# remove a column
# to make it permanent 
df.drop('Salary',axis=1,inplace=True)

In [51]:
df

     Name  Age       City
0  rashmi   33  Bangalore
1    ruhi   56     ranchi
2  ragini   39    Bangkok

In [52]:
# add age to the column 
df['Age'] = df['Age']+1

In [53]:
df

     Name  Age       City
0  rashmi   34  Bangalore
1    ruhi   57     ranchi
2  ragini   40    Bangkok

In [54]:
df.drop(0,inplace=True)

In [55]:
df

     Name  Age     City
1    ruhi   57   ranchi
2  ragini   40  Bangkok

In [57]:
df_2.head(5)

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [58]:
# display the data types of each column 
print("data types:\n",df_2.dtypes)

data types:
 Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [59]:
# display the data types of each column 
print("Statistical summar:\n",df_2.describe)

Statistical summar:
 <bound method NDFrame.describe of           Date Category  Value   Product  Sales Region
0   2023-01-01        A   28.0  Product1  754.0   East
1   2023-01-02        B   39.0  Product3  110.0  North
2   2023-01-03        C   32.0  Product2  398.0   East
3   2023-01-04        B    8.0  Product1  522.0   East
4   2023-01-05        B   26.0  Product3  869.0  North
5   2023-01-06        B   54.0  Product3  192.0   West
6   2023-01-07        A   16.0  Product1  936.0   East
7   2023-01-08        C   89.0  Product1  488.0   West
8   2023-01-09        C   37.0  Product3  772.0   West
9   2023-01-10        A   22.0  Product2  834.0   West
10  2023-01-11        B    7.0  Product1  842.0  North
11  2023-01-12        B   60.0  Product2    NaN   West
12  2023-01-13        A   70.0  Product3  628.0  South
13  2023-01-14        A   69.0  Product1  423.0   East
14  2023-01-15        A   47.0  Product2  893.0   West
15  2023-01-16        C    NaN  Product1  895.0  North
16  2023-01-17        C   93.0  Product2  511.0  South
17  2023-01-18        C    NaN  Product1  108.0   West
18  2023-01-19        A   31.0  Product2  578.0   West
19  2023-01-20        A   59.0  Product1  736.0   East
20  2023-01-21        C   82.0  Product3  606.0  South
21  2023-01-22        C   37.0  Product2  992.0  South
22  2023-01-23        B   62.0  Product3  942.0  North
23  2023-01-24        C   92.0  Product2  342.0   West
24  2023-01-25        A   24.0  Product2  458.0   East
25  2023-01-26        C   95.0  Product1  584.0   West
26  2023-01-27        C   71.0  Product2  619.0  North
27  2023-01-28        C   56.0  Product2  224.0  North
28  2023-01-29        B    NaN  Product3  617.0  North
29  2023-01-30        C   51.0  Product2  737.0  South
30  2023-01-31        B   50.0  Product3  735.0   West
31  2023-02-01        A   17.0  Product2  189.0   West
32  2023-02-02        B   63.0  Product3  338.0  South
33  2023-02-03        C   27.0  Product3    NaN   East
34  2023-02-04        C   70.0  Product3  669.0   West
35  2023-02-05        B   60.0  Product2    NaN   West
36  2023-02-06        C   36.0  Product3  177.0   East
37  2023-02-07        C    2.0  Product1    NaN  North
38  2023-02-08        C   94.0  Product1  408.0  South
39  2023-02-09        A   62.0  Product1  155.0   West
40  2023-02-10        B   15.0  Product1  578.0   East
41  2023-02-11        C   97.0  Product1  256.0   East
42  2023-02-12        A   93.0  Product3  164.0   West
43  2023-02-13        A   43.0  Product3  949.0   East
44  2023-02-14        A   96.0  Product3  830.0   East
45  2023-02-15        B   99.0  Product2  599.0   West
46  2023-02-16        B    6.0  Product1  938.0  South
47  2023-02-17        B   69.0  Product3  143.0   West
48  2023-02-18        C   65.0  Product3  182.0  North
49  2023-02-19        C   11.0  Product3  708.0  North>

In [61]:
grouped = df_2.groupby('Category')['Value'].mean()
print("Mean value by category:\n",grouped)

Mean value by category:
 Category
A    48.357143
B    44.142857
C    59.842105
Name: Value, dtype: float64

In [56]:
print(df_2.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 6 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      50 non-null     object
 1   Category  50 non-null     object
 2   Value     47 non-null     float64
 3   Product   50 non-null     object
 4   Sales     46 non-null     float64
 5   Region    50 non-null     object
dtypes: float64(2), object(4)
memory usage: 2.5+ KB
None

In [62]:
df_2.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000